torture/30
toss/523
totalitarian/280
totem/1O1
totter/431
touching/309
touchstone/512
touchy/535
toupee/210/p
tournament/127
tourniquet/403
tousle/149
tout/568
toxic/222
toxin/240
toy/444
traceable/397
track/60
tract/192
tractability/484
tractable/413
traduce/380
tragedy/229
traipse/223
trait/352
traitor/28
trajectory/465
trammel/435
tramp/349
trample/389
trance/13
tranquility/435
transaction/33
transcend/34
transcendent/410
transcendental/122
transcribe/15
transfer/351
transfigure/428
transfuse/572
transgress/363
transgression/469
transience/549
transient/459
transition/106
transitory/186
translucent/448
transmit/454
transmute/418
transparent/199
transplantation/343
transport/100
transpose/269
trapeze/491
traverse/355
travesty/132/?p
trawl/521
treacherous/339
treachery/9
tread/446
treason/238
treasurer/138
treatise/350
treaty/90
trek/173
tremendous/150
tremor/269
tremulous/354
trench/446
trenchant/402
trend/96
trepidation/427
trespass/453
tresses/449
tribulation/240
tribunal/364
tributary/294
tribute/182
trickery/5
trickle/148
trident/409
trifle/42
trigger/126
trilogy/260
trim/19
trinket/296
trio/287
tripod/538
trite/144
triumph/127
trivia/336
trivial/14
troll/580
trophy/552
trounce/573/?
troupe/518
trowel/564
truancy/22
truant/57
truce/89
truculent/246
trudge/356
truism/500
trumpery/568
trumpet/449
truncate/411
trunk/103
truss/78
trustworthy/110
tuber/524
tumble/575
tumid/48
tumult/417
tundra/87
turbulent/296
tureen/269
turgid/562
turmoil/157
turncoat/428
turpitude/305
turquoise/427
turret/523
tusk/389
tussle/1
tutelage/80
tutor/373
tuxedo/79
twaddle/555/?
tweak/575
twig/223
twinge/344
tycoon/424
typhoon/152
typo/386
typographical/155
tyranny/20
tyrant/119
tyro/245
ubiquitous/439
ugly/414
ulcer/337
ulcerate/271
ulterior/446/p
ultimate/418
ultramundane/447
umbrage/441
umpire/263
unaffected/181
unanimous/271
unassuming/107
unbecoming/2
unbend/419
unbidden/110
unbosom/579
unbridled/37
uncanny/488
uncommitted/14
unconscionable/311
unconscious/75
uncooperative/449
uncouth/187/p
unctuous/79
underbid/12
undercut/422
underdog/293
underestimated/38
undergird/236
underhanded/81
underling/429
underlying/513
undermine/323
underplay/272
underrate/403
underscore/185
understate/203
understated/376
understatement/70
understudy/151
underutilized/130
underwrite/88
undeserved/425
undesirable/135
undirected/122
undisputable/216
undulate/221
unearth/131
unearthly/457
unenlightened/464
unexceptionable/228
unexceptional/39
unfailing/567
unfasten/85
unfeigned/288
unflappable/95
unfold/553
unfounded/542
ungainly/305/?
ungrudging/197
unguent/447
unicorn/326
unidimensional/36
unification/510
uniform/537
unify/427
unilateral/502
unimpassioned/340
unimpeachable/301
uninitiated/132
unique/567
unison/371
univocal/150
unjustified/502
unjustly/133
unkempt/273
unleash/317
unmitigated/536
