fortitude/312
fortuitous/490
forum/387
forward/199/r
fosse/495/p
fossilize/108
foster/97
foul/79
founder/223
four-poster/394
foyer/201/p
fracas/21/?p
fraction/32
fractional/74
fractious/182/?
fracture/493
fragile/113
fragment/330
fragrance/524
fragrant/3
frail/417
frantic/193
fraternal/317
fraternity/161
fraud/118
fraudulent/471
fraught/154
fray/200/?
freak/27
freckle/75
freelancer/279
freestanding/576
freight/156
frenetic/419
frenzy/374
frequency/327
frequent/404
fresco/50
fret/156/?
fretwork/165
friable/374
friction/303
frieze/528
frigid/326
frigidity/374
fringe/442
frisk/484
frisky/141
fritter/313/?
frivolous/296
frolic/351
frolicsome/36
frond/298
frothy/60
frowzy/384
fructify/501
frugal/102
fruition/25
frumpy/579/?
frustrate/525
fuddle/578
fulcrum/100
fulfil/564
full-blown/366
full-bodied/293
full-fledged/554
fulminate/310
fulsome/71/?
fumble/254
fume/517
fumigate/1/p
functional/110
functionary/126/r
fundamental/56
funereal/2
fungi/323
fungicide/349
funky/577
furbish/414
furnace/549
furor/207
furrow/531
furtive/545
fury/302
fusillade/338
fusion/67
fuss/409
fussy/226/?
fustian/336
fusty/25
futile/10
futility/303
gab/182
gabble/137
gabby/574
gadfly/160
gadget/398
gaffe/308
gag/9
gaggle/8
gaiety/198
gainsay/215/p
gait/14
galaxy/284
gale/204
gall/43
gallant/252
galley/570
gallon/556
gallop/232
gallows/43
galvanize/496
gamble/307
gambol/171
gamut/12
gander/224
gangling/485
gangly/351
gangrene/460
gangway/325
gape/137
garble/412
garbled/402
gardenia/1
gargantuan/498
gargoyle/458
garish/280
garland/386
garment/73
garner/63
garnish/398
garret/336
garrulity/550
garrulous/301
gaseous/231
gash/64
gasification/464
gastric/352
gastritis/263
gastronomy/509
gauche/196
gaucherie/397
gaudy/291
gauge/403
gaunt/320
gavel/496
gawky/575
gaze/568
gazetteer/148
gear/537
gem/317
gene/118
genealogy/350
generality/288
generalize/61
generate/20
generation/212
generator/294
generic/487
generosity/305
genesis/126
genetic/424
generics/291
genial/476/p
genome/55
genre/448
genteel/537
gentle/349
gentry/334
genuflect/245
genuine/564
genus/454
geometrician/42
germ/512
germane/370
germicide/491
germinate/468
gerontocracy/490
gerontology/391
gerrymander/9
gestate/77
gestation/70
gesticulate/153
gesture/302
geyser/124
ghastly/449
gibe/303
giddy/568
giggle/192
gild/388
gimmick/163
ginger/478
gingerly/31
girder/127
girdle/9
girth/317
gist/400
glacial/566
glade/378
gladiator/544
glamorous/229
glare/480
glaze/83
gleam/129
glean/126
glee/293
glib/323
glide/42
glimmer/399
glimpse/35
glisten/106
glitch/565
glitter/29
gloaming/168
gloat/339
