ersatz/341/p
erstwhile/140
erudite/60
erupt/329
escalate/411
escapism/68
eschew/129/p
escort/52
esophagus/237
esoteric/130
espionage/93
espousal/446
espouse/399
espy/482/p
essential/64
estimable/379
estrange/241
estranged/484
estuary/365
etch/218
etching/423
eternal/152
ethereal/332/p
ethics/228
ethnic/321
ethnology/430
ethos/326/p
etiquette/190
etymology/517
eugenic/46
eulogistic/423
eulogize/82
eulogy/148
euphemism/198/p
euphonious/178
euphoria/106
evacuate/503
evade/390
evaluation/365
evanescent/482
evaporate/386
evasion/504
evasive/352
even/271
evenhanded/256
even-tempered/149
everlasting/235
evict/440
evildoer/502
evince/331
eviscerate/416
evocative/63
evoke/531
evolve/307
ewe/102
ewer/289
exacerbate/398
exact/310
exacting/467
exactitude/147
exaggerate/302
exalt/16
exaltation/491
exasperate/194
excavate/418
exceed/542
exceptionable/410
exceptional/224
excerpt/70
excess/192
exchequer/169
excise/96/?
excitability/376
exclaim/478
exclamation/321
exclude/71
exclusive/189
excogitate/45
excoriate/523
excrete/569
excruciate/567
exculpate/69/p
excursion/59
excursive/297
execrable/173
execrate/563
execration/376
execute/129
exemplary/112
exemplify/32
exempt/529
exert/215
exhale/265
exhaust/236
exhaustive/335
exhilarate/22
exhilaration/355
exhort/148
exhume/77
exigent/194/p
exiguous/273/?
existential/563
exodus/290
exonerate/15
exorbitant/358
exorcise/66
exotic/4
expand/457
expansive/534
expatiate/407
expatriate/549
expediency/513
expedient/180
expeditious/344/p
expel/568
expend/247
expenditure/355
expertise/313
expiate/17
expiation/120
expiration/562
expire/559
explicable/412
explicate/331
explicit/183
exploit/255
explosive/391
exponent/374/p
exponentially/83
exposition/434
expository/422
expostulate/213/?
exposure/342
expound/109
expressly/413
expropriate/128
expulsion/466
expunge/442
expurgate/30
exquisite/164
extant/332
extemporaneous/311
extemporize/342
extend/512
extenuate/321
exterminate/368
externalize/570
extinct/511
extinguish/216
extirpation/251
extol/136
extort/243
extract/366
extradite/419
extraneous/43
extrapolate/259
extravagance/123
extremist/273
extricable/139/p
extricate/152
extrinsic/512
extrovert/565
extrude/311
exuberance/283
exuberant/329
exude/361
exult/394
exultant/441
fabric/397
fabricate/516
fabulous/78
facade/443
facet/159
facetious/189/p
facile/452/p
facilitate/354
facilities/139
facsimile/552
faction/119
factitious/96
factorable/361
factotum/366/p
factual/344
faculty/437
fad/111
faddish/25
fade/536
fag/84
fail-safe/126
fainthearted/129
fair-minded/10
fake/300
falcon/451
fallacious/201
fallacy/90
fallibility/299
fallible/20
fallow/465
falsehood/551
falsify/246
falter/175
familiarity/397
famine/566
famish/382
fanatic/139
fancied/575
fanfare/138
fang/519
fantasia/481
fantasy/141
farce/123
farewell/94
far-reaching/94
farrow/551
fascia/152/p
fascinate/35
