delicacy/217
delicate/315
delimit/159
delineate/565
delinquency/461
delinquent/79
delirious/119
delirium/452
delta/508
delude/40/?
deluge/57/pr
delusion/206
deluxe/580
delve/432
demagogue/409
demand/565
demarcate/478
demean/404
demeanour/524
demented/528
demise/27
demography/357
demolish/439
demolition/100
demonstrate/136
demonstrative/311
demoralize/90
demote/24
demotic/182
demur/413/p
demure/31
demystify/173
den/64
denigrate/370
denizen/332
denominate/362
denomination/422
denote/539
denouement/27/p
denounce/148
dent/390
denture/328
denude/146
denunciate/384
depict/458
deplete/235
deplore/436
deport/123
deportment/114
depose/145
deposit/443
deposition/437
depraved/478
depravity/224
deprecate/540
depreciate/182
depredation/206/?
depressant/494
depressed/108
depression/74
deprivation/305
depute/159
deputize/533
deputy/320
deracinate/503
derangement/372
derelict/176/p
dereliction/5
deride/7/p
derivation/312
derivative/518
dermatologist/71
derogate/217
desalinize/44
descendant/250
descent/535
descry/430
desecrate/443
desert/502
desiccate/49
desideratum/196
designate/546
designation/489
desirable/305
desirous/349
desist/574
desolate/342
desperado/440
desperate/326
despicable/2
despise/235
despoil/472/?
despot/225
destitute/353
destitution/450
destructible/371
desuetude/100/p
desultory/205/p
detach/31
detached/324
detain/17
detection/428
deter/201
detergent/455
deteriorate/77
detest/217
detestable/54
detonate/237
detonation/420
detour/257
detract/515
detraction/264/?
detrimental/35
detritus/452
devastate/391
deviant/232
deviate/165
deviation/316
devious/119/p
devise/299
devoid/503
devolve/182
devoted/104
devotee/353
devotional/199
devour/271
devout/161
dexterity/302
dexterous/524
diabetes/64
diabolic/335
diabolical/85
diagnose/278
diagonal/145
diagram/258
dialect/565
diameter/240
diaphanous/94/p
diatribe/234
dicker/575
dictate/102
dictator/223
dictum/122
didactic/262
die/357
die-hard/545
dietetics/89
diffident/62
diffuse/368
digestion/359
digit/327
dignitary/563
dignity/175
digress/100
dike/529
dilapidate/331
dilapidated/76
dilapidation/189
dilate/173
dilatory/108/p
dilemma/185
dilettante/247/p
diligence/381
dillydally/575
dilute/130
dim/118
dimension/252
diminuendo/166
diminution/407
dimple/67
din/402
dingy/415
diocesan/533/p
diplomatic/61
dipsomania/544
dire/551
dirge/510
disabuse/12/?
disaffect/520
disagreeable/530
disarm/439
disarray/138
disaster/472
disavow/542
disband/536
disbar/465
disburse/4
discard/486
discern/322
discernible/437
discerning/516
discharge/64
disciple/336
discipline/564
disclaim/480
disclaimer/327
disclose/211
discography/442
discombobulate/318
discombobulated/360
discomfit/533/p
discompose/4/?
disconcert/441
discord/367
discount/367
discourse/485
discredit/402
discreet/286
discrepancy/549
discrete/157
discretion/9
discretionary/376
discriminate/409
discriminatory/222
discursive/505
disdain/72
